# 用于调查在选择不同数组作为前导0特殊值时的压缩结果
import itertools

data = {
    0: 551186,
    1: 476828,
    2: 2627,
    3: 864,
    4: 58578,
    5: 349651,
    6: 713243,
    7: 1048405,
    8: 594684,
    9: 900432,
    10: 698740,
    11: 413837,
    12: 258990,
    13: 136181,
    14: 69117,
    15: 34856,
    16: 17641,
    17: 8725,
    18: 4299,
    19: 2194,
    20: 1084,
    21: 584,
    22: 285,
    23: 127,
    24: 66,
    25: 32,
    26: 7,
    27: 2,
    28: 2,
    29: 1,
    30: 0,
    31: 0,
    32: 300261
}

list1=[0,8,12,16,18,20,22,24]    # 原chimp论文选取的特殊值
list2=[0,4,6,8,10,12,14,16]      # 按照chimp论文理论选取的新的特殊值
list3=[0,5,6,7,8,9,10,11]        # 修改过后的特殊值


# 用于测试不同特征值的压缩效果
def test(list1):
    i=6684000*5         #假设全需要存储前导零的情况下 gorilla算法存储的前导0总位数
    result=0
    for key in data.keys():
        if key in list1 or key==32:
            continue;
        x=0
        while key>list1[x] and x<=7:
            x=x+1
            if x>7:
                break
        result+=(data[key]*(key-list1[x-1]))
    print("特殊值:")
    print(list1)
    print(i-(6684000*3+result))
    print("压缩效果:")
    print((6684000 * 3 + result) / i)

    return (6684000*3+result)/i




test(list1)
test(list2)
test(list3)

